Revit 2027 API
AdvancedGlazing.GlazingTransmissionColor Property
 The property labeled "Transmissive color" from the "AdvancedGlazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GlazingTransmissionColor { get; }
Public Shared ReadOnly Property GlazingTransmissionColor As String
	Get
public:
static property String^ GlazingTransmissionColor {
	String^ get ();
}
static member GlazingTransmissionColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace